In [1]:
import pandas as pd
import numpy as np

# IMPORT DATASET

In [2]:
import warnings
warnings.filterwarnings('ignore')

books = pd.read_csv(r"dataset/Books.csv", delimiter=';', error_bad_lines=False, encoding='ISO-8859-1', warn_bad_lines=False)
users = pd.read_csv(r"dataset/Users.csv", delimiter=';', error_bad_lines=False, encoding='ISO-8859-1', warn_bad_lines=False)
ratings = pd.read_csv(r"dataset/Book-Ratings.csv", delimiter=';', error_bad_lines=False, encoding='ISO-8859-1', warn_bad_lines=False)

# PREPROCESSING BOOKS_DF

In [3]:
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [4]:
books.drop(['Image-URL-S', 'Image-URL-M', 'Image-URL-L'], axis=1, inplace=True)

In [5]:
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

In [6]:
books.info()           #found 1 nulll values in Book_author and 2 null_value in Publisher

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271360 entries, 0 to 271359
Data columns (total 5 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271360 non-null  object
 1   Book-Title           271360 non-null  object
 2   Book-Author          271359 non-null  object
 3   Year-Of-Publication  271360 non-null  object
 4   Publisher            271358 non-null  object
dtypes: object(5)
memory usage: 10.4+ MB

# Drop nonnull rows

In [7]:
books.drop(books[books['Book-Author'].isnull()].index,inplace=True)

In [8]:
books.drop(books[books['Publisher'].isnull()].index,inplace=True)

In [9]:
books.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 271357 entries, 0 to 271359
Data columns (total 5 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271357 non-null  object
 1   Book-Title           271357 non-null  object
 2   Book-Author          271357 non-null  object
 3   Year-Of-Publication  271357 non-null  object
 4   Publisher            271357 non-null  object
dtypes: object(5)
memory usage: 12.4+ MB

In [10]:
books.reset_index(inplace=True)

## Remove non int values from Year_of_pub

In [11]:
dum=list(books['Year-Of-Publication'].unique())
dum2=np.char.isdigit(dum)
dum3=[]
for i in range(len(dum2)):
    if dum2[i]==False:
        dum3.append(dum[i])
dum3.sort()
dum3

['DK Publishing Inc', 'Gallimard']

In [12]:
index_list=[]
index_list.append(books[books['Year-Of-Publication']==dum3[0]].index)
# index_list.append(books[books['Year-Of-Publication']==dum3[1]].index)

In [13]:
index_list=np.array(index_list)
index_list=index_list.flatten()

In [14]:
index_list=np.append(index_list,books[books['Year-Of-Publication']==dum3[1]].index,axis=0)

In [15]:
books.loc[index_list]

,index,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
209535,209538,078946697X,"DK Readers: Creating the X-Men, How It All Beg...",2000,DK Publishing Inc,http://images.amazon.com/images/P/078946697X.0...
221675,221678,0789466953,"DK Readers: Creating the X-Men, How Comic Book...",2000,DK Publishing Inc,http://images.amazon.com/images/P/0789466953.0...
220728,220731,2070426769,"Peuple du ciel, suivi de 'Les Bergers\"";Jean-M...",2003,Gallimard,http://images.amazon.com/images/P/2070426769.0...

In [16]:
books.at[209535 ,'Publisher'] = 'DK Publishing Inc'
books.at[209535 ,'Year-Of-Publication'] = 2000
books.at[209535 ,'Book-Author'] = 'Michael Teitelbaum'

books.at[221675 ,'Publisher'] = 'DK Publishing Inc'
books.at[221675 ,'Year-Of-Publication'] = 2000
books.at[221675 ,'Book-Author'] = 'James Buckley'

books.at[220728 ,'Publisher'] = 'Gallimard'
books.at[220728 ,'Year-Of-Publication'] = '2003'
books.at[220728 ,'Book-Author'] = 'Jean-Marie Gustave Le ClÃ?Â©zio'

In [17]:
books.loc[index_list]

,index,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
209535,209538,078946697X,"DK Readers: Creating the X-Men, How It All Beg...",Michael Teitelbaum,2000,DK Publishing Inc
221675,221678,0789466953,"DK Readers: Creating the X-Men, How Comic Book...",James Buckley,2000,DK Publishing Inc
220728,220731,2070426769,"Peuple du ciel, suivi de 'Les Bergers\"";Jean-M...",Jean-Marie Gustave Le ClÃ?Â©zio,2003,Gallimard


# Remove duplicate years and convert to valid years

In [18]:
books['Year-Of-Publication'] = books['Year-Of-Publication'].astype(int)

In [19]:
year_list=sorted(list(books['Year-Of-Publication'].unique()))

In [20]:
year_list=np.array(year_list)

In [21]:
year_list

array([   0, 1376, 1378, 1806, 1897, 1900, 1901, 1902, 1904, 1906, 1908,
       1909, 1910, 1911, 1914, 1917, 1919, 1920, 1921, 1922, 1923, 1924,
       1925, 1926, 1927, 1928, 1929, 1930, 1931, 1932, 1933, 1934, 1935,
       1936, 1937, 1938, 1939, 1940, 1941, 1942, 1943, 1944, 1945, 1946,
       1947, 1948, 1949, 1950, 1951, 1952, 1953, 1954, 1955, 1956, 1957,
       1958, 1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968,
       1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979,
       1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990,
       1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001,
       2002, 2003, 2004, 2005, 2006, 2008, 2010, 2011, 2012, 2020, 2021,
       2024, 2026, 2030, 2037, 2038, 2050])

In [22]:
from collections import Counter
## Replacing Invalid years with max year
count = Counter(books['Year-Of-Publication'])
[k for k, v in count.items() if v == max(count.values())]

[2002]

In [23]:
books[(books['Year-Of-Publication']<1900)|(books['Year-Of-Publication']>2020)]

,index,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
176,176,3150000335,Kabale Und Liebe,Schiller,0,"Philipp Reclam, Jun Verlag GmbH"
188,188,342311360X,Die Liebe in Den Zelten,Gabriel Garcia Marquez,0,Deutscher Taschenbuch Verlag (DTV)
288,288,0571197639,Poisonwood Bible Edition Uk,Barbara Kingsolver,0,Faber Faber Inc
351,351,3596214629,"Herr Der Fliegen (Fiction, Poetry and Drama)",Golding,0,Fischer Taschenbuch Verlag GmbH
542,542,8845229041,Biblioteca Universale Rizzoli: Sulla Sponda De...,P Coelho,0,Fabbri - RCS Libri
...,...,...,...,...,...,...
270791,270794,014029953X,Foe (Essential.penguin S.),J.M. Coetzee,0,Penguin Books Ltd
270910,270913,0340571187,Postmens House,Maggie Hemingway,0,Trafalgar Square
271091,271094,8427201079,El Misterio De Sittaford,Agatha Christie,0,Editorial Molino
271179,271182,0887781721,Tom Penny,Tony German,0,P. Martin Associates
271193,271196,3150013763,Der Hofmeister,Jakob Lenz,0,"Philipp Reclam, Jun Verlag GmbH"

In [24]:
books.loc[books['Year-Of-Publication'] > 2020, 'Year-Of-Publication'] = 2002
books.loc[books['Year-Of-Publication'] <1900, 'Year-Of-Publication'] = 2002

In [25]:
books[(books['Year-Of-Publication']<1900)|(books['Year-Of-Publication']>2020)]['Year-Of-Publication']

Series([], Name: Year-Of-Publication, dtype: int32)


# OTHER preprocessing

In [26]:

## Uppercasing all alphabets in ISBN
books['ISBN'] = books['ISBN'].str.upper()

In [27]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271357 entries, 0 to 271356
Data columns (total 6 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   index                271357 non-null  int64
 1   ISBN                 271357 non-null  object
 2   Book-Title           271357 non-null  object
 3   Book-Author          271357 non-null  object
 4   Year-Of-Publication  271357 non-null  int32
 5   Publisher            271357 non-null  object
dtypes: int32(1), int64(1), object(4)
memory usage: 11.4+ MB

In [28]:
## Drop duplicate rows
books.drop_duplicates(keep='last', inplace=True) 
books.reset_index(drop = True, inplace = True)

In [29]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271357 entries, 0 to 271356
Data columns (total 6 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   index                271357 non-null  int64
 1   ISBN                 271357 non-null  object
 2   Book-Title           271357 non-null  object
 3   Book-Author          271357 non-null  object
 4   Year-Of-Publication  271357 non-null  int32
 5   Publisher            271357 non-null  object
dtypes: int32(1), int64(1), object(4)
memory usage: 11.4+ MB

In [30]:
books.head()

,index,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

# Users data preprocessing

In [31]:
users.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [32]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278858 entries, 0 to 278857
Data columns (total 3 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   User-ID   278858 non-null  int64
 1   Location  278858 non-null  object
 2   Age       168096 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 6.4+ MB

In [33]:
278858-168096       #null values

110762

In [34]:
age_list=sorted(list(users['Age'].unique()))

In [35]:
age_list=np.array(age_list)

In [36]:
T_F_list=(age_list<80) & (age_list>10)

In [37]:
age_list[T_F_list].mean()

45.0

In [38]:
baseline = users[users['Age'] <= 80]
baseline = baseline[baseline['Age'] >= 10]

In [39]:
mean=round(baseline['Age'].mean())

## subsitute all outlier,non_null values with mean

In [40]:
users.loc[users['Age'] > 80, 'Age'] = mean

In [41]:
users.loc[users['Age'] <10, 'Age'] = mean

In [42]:
users['Age'] = users['Age'].fillna(mean)

In [43]:
print(sorted(list(users['Age'].unique())))

[10.0, 11.0, 12.0, 13.0, 14.0, 15.0, 16.0, 17.0, 18.0, 19.0, 20.0, 21.0, 22.0, 23.0, 24.0, 25.0, 26.0, 27.0, 28.0, 29.0, 30.0, 31.0, 32.0, 33.0, 34.0, 35.0, 36.0, 37.0, 38.0, 39.0, 40.0, 41.0, 42.0, 43.0, 44.0, 45.0, 46.0, 47.0, 48.0, 49.0, 50.0, 51.0, 52.0, 53.0, 54.0, 55.0, 56.0, 57.0, 58.0, 59.0, 60.0, 61.0, 62.0, 63.0, 64.0, 65.0, 66.0, 67.0, 68.0, 69.0, 70.0, 71.0, 72.0, 73.0, 74.0, 75.0, 76.0, 77.0, 78.0, 79.0, 80.0]

# CONVERTING ADDRESS TO CITY,STATE,COUNTRY FORMET

In [44]:
users.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa  35.0
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia  35.0
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom  35.0

In [45]:
list_Loc = users.Location.str.split(', ')

In [46]:
list_Loc

0                         [nyc, new york, usa]
1                  [stockton, california, usa]
2            [moscow, yukon territory, russia]
3                  [porto, v.n.gaia, portugal]
4         [farnborough, hants, united kingdom]
                          ...
278853                 [portland, oregon, usa]
278854    [tacoma, washington, united kingdom]
278855             [brampton, ontario, canada]
278856             [knoxville, tennessee, usa]
278857                  [dublin, n/a, ireland]
Name: Location, Length: 278858, dtype: object

In [47]:
city = []
state = []
country = []
count_no_state = 0    
count_no_country = 0

In [48]:
for i in range(0,len(list_Loc)):
    if list_Loc[i][0] == ' ' or list_Loc[i][0] == '' or list_Loc[i][0]=='n/a' or list_Loc[i][0] == ',':  #removing invalid entries too
        city.append('other')
    else:
        city.append(list_Loc[i][0].lower())

In [49]:
for i in range(0,len(list_Loc)):
    if(len(list_Loc[i])<2):
        state.append('other')
        country.append('other')
        count_no_state += 1
        count_no_country += 1
    else:
        if list_Loc[i][1] == ' ' or list_Loc[i][1] == '' or list_Loc[i][1]=='n/a' or list_Loc[i][1] == ',':   #removing invalid entries 
            state.append('other')
            count_no_state += 1            
        else:
            state.append(list_Loc[i][1].lower())
        
        if(len(list_Loc[i])<3):
            country.append('other')
            count_no_country += 1
        else:
            if list_Loc[i][2] == ''or list_Loc[i][1] == ',' or list_Loc[i][2] == ' ' or list_Loc[i][2] == 'n/a':
                country.append('other')
                count_no_country += 1
            else:
                country.append(list_Loc[i][2].lower())

In [50]:
len(city)
len(state)
len(country)

278858

In [51]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278858 entries, 0 to 278857
Data columns (total 3 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   User-ID   278858 non-null  int64
 1   Location  278858 non-null  object
 2   Age       278858 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 6.4+ MB

In [52]:
users['city']=city

In [53]:
users['state']=state

In [54]:
users['country']=country

In [55]:
users

,User-ID,Location,Age,city,state,country
0,1,"nyc, new york, usa",35.0,nyc,new york,usa
1,2,"stockton, california, usa",18.0,stockton,california,usa
2,3,"moscow, yukon territory, russia",35.0,moscow,yukon territory,russia
3,4,"porto, v.n.gaia, portugal",17.0,porto,v.n.gaia,portugal
4,5,"farnborough, hants, united kingdom",35.0,farnborough,hants,united kingdom
...,...,...,...,...,...,...
278853,278854,"portland, oregon, usa",35.0,portland,oregon,usa
278854,278855,"tacoma, washington, united kingdom",50.0,tacoma,washington,united kingdom
278855,278856,"brampton, ontario, canada",35.0,brampton,ontario,canada
278856,278857,"knoxville, tennessee, usa",35.0,knoxville,tennessee,usa
278857,278858,"dublin, n/a, ireland",35.0,dublin,other,ireland

In [56]:
users = users.drop('Location',axis=1)

In [57]:
users.head()

   User-ID   Age         city            state         country
0        1  35.0          nyc         new york             usa
1        2  18.0     stockton       california             usa
2        3  35.0       moscow  yukon territory          russia
3        4  17.0        porto         v.n.gaia        portugal
4        5  35.0  farnborough            hants  united kingdom

In [58]:
print(count_no_country)   #printing the number of countries didnt have any values 
print(count_no_state)     #printing the states which didnt have any values

4659
16044

In [59]:
users.drop_duplicates(keep='last', inplace=True)
users.reset_index(drop=True, inplace=True)

In [60]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278858 entries, 0 to 278857
Data columns (total 5 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   User-ID  278858 non-null  int64
 1   Age      278858 non-null  float64
 2   city     278858 non-null  object
 3   state    278858 non-null  object
 4   country  278858 non-null  object
dtypes: float64(1), int64(1), object(3)
memory usage: 10.6+ MB

# preprocessing ratings dataset

In [61]:
ratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [62]:
ratings.info() #no notnull values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1149780 entries, 0 to 1149779
Data columns (total 3 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   User-ID      1149780 non-null  int64
 1   ISBN         1149780 non-null  object
 2   Book-Rating  1149780 non-null  int64
dtypes: int64(2), object(1)
memory usage: 26.3+ MB

## checking if all ratings are ints

In [63]:
sorted(list(ratings['Book-Rating'].unique()))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [64]:
import re

In [65]:
# ## checking ISBN
# flag = 0
# k =[]
# reg = "[^A-Za-z0-9]"

# for x in ratings['ISBN']:
#     z = re.search(reg,x)    
#     if z:
#         flag = 1
#     if flag == 1:
#         print("False")
#     else:
#         print("True")

In [66]:
ratings

         User-ID         ISBN  Book-Rating
0         276725   034545104X            0
1         276726   0155061224            5
2         276727   0446520802            0
3         276729   052165615X            3
4         276729   0521795028            6
...          ...          ...          ...
1149775   276704   1563526298            9
1149776   276706   0679447156            0
1149777   276709   0515107662           10
1149778   276721   0590442449           10
1149779   276723  05162443314            8

[1149780 rows x 3 columns]

In [67]:
## removing extra characters from ISBN (from ratings dataset) existing in books dataset
bookISBN = books['ISBN'].tolist() 
reg = "[^A-Za-z0-9]" 
for index, row_Value in ratings.iterrows():
    z = re.search(reg, row_Value['ISBN'])    
    if z:
        f = re.sub(reg,"",row_Value['ISBN'])
        if f in bookISBN:
            ratings.at[index , 'ISBN'] = f

In [73]:
ratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [69]:
ratings['ISBN'] = ratings['ISBN'].str.upper()

In [70]:
## Drop duplicate rows
ratings.drop_duplicates(keep='last', inplace=True)
ratings.reset_index(drop=True, inplace=True)

In [71]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1149776 entries, 0 to 1149775
Data columns (total 3 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   User-ID      1149776 non-null  int64
 1   ISBN         1149776 non-null  object
 2   Book-Rating  1149776 non-null  int64
dtypes: int64(2), object(1)
memory usage: 26.3+ MB

In [72]:
ratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

# Merging of all three Tables

In [74]:
df = pd.merge(books, ratings, on='ISBN', how='inner')
df = pd.merge(df, users, on='User-ID', how='inner')
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1045297 entries, 0 to 1045296
Data columns (total 12 columns):
 #   Column               Non-Null Count    Dtype
---  ------               --------------    -----
 0   index                1045297 non-null  int64
 1   ISBN                 1045297 non-null  object
 2   Book-Title           1045297 non-null  object
 3   Book-Author          1045297 non-null  object
 4   Year-Of-Publication  1045297 non-null  int32
 5   Publisher            1045297 non-null  object
 6   User-ID              1045297 non-null  int64
 7   Book-Rating          1045297 non-null  int64
 8   Age                  1045297 non-null  float64
 9   city                 1045297 non-null  object
 10  state                1045297 non-null  object
 11  country              1045297 non-null  object
dtypes: float64(1), int32(1), int64(3), object(7)
memory usage: 99.7+ MB

In [75]:
df.head()

,index,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,User-ID,Book-Rating,Age,city,state,country
0,0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,2,0,18.0,stockton,california,usa
1,1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,8,5,35.0,timmins,ontario,canada
2,2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,8,0,35.0,timmins,ontario,canada
3,3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,8,0,35.0,timmins,ontario,canada
4,4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,8,0,35.0,timmins,ontario,canada

In [77]:
## which has rating
df1 = df[df['Book-Rating'] != 0]
df1 = df1.reset_index(drop = True)
df1.shape

(389524, 12)

In [78]:
## which doesnt have ratings
df2 = df[df['Book-Rating'] == 0]
df2 = df2.reset_index(drop = True)
df2.shape

(655773, 12)

In [79]:
df1.head()

,index,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,User-ID,Book-Rating,Age,city,state,country
0,1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,8,5,35.0,timmins,ontario,canada
1,9,074322678X,Where You'll Find Me: And Other Stories,Ann Beattie,2002,Scribner,8,5,35.0,timmins,ontario,canada
2,12,0887841740,The Middle Stories,Sheila Heti,2004,House of Anansi Press,8,5,35.0,timmins,ontario,canada
3,13,1552041778,Jane Doe,R. J. Kaiser,1999,Mira Books,8,5,35.0,timmins,ontario,canada
4,15,1567407781,The Witchfinder (Amos Walker Mystery Series),Loren D. Estleman,1998,Brilliance Audio - Trade,8,6,35.0,timmins,ontario,canada

In [80]:
df2.head()

,index,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,User-ID,Book-Rating,Age,city,state,country
0,0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,2,0,18.0,stockton,california,usa
1,2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,8,0,35.0,timmins,ontario,canada
2,3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,8,0,35.0,timmins,ontario,canada
3,4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,8,0,35.0,timmins,ontario,canada
4,5,0399135782,The Kitchen God's Wife,Amy Tan,1991,Putnam Pub Group,8,0,35.0,timmins,ontario,canada

In [81]:
users.to_csv(r'new_dataset/users.csv')
ratings.to_csv(r'new_dataset/ratings.csv')
books.to_csv(r'new_dataset/books.csv')
df.to_csv(r'new_dataset/merge.csv')
df1.to_csv(r'new_dataset/has_ratings.csv')
df2.to_csv(r'new_dataset/no_ratings.csv')